Tekla Open API Reference for Tekla Structures 2025
ProjectInfo.GetStringUserProperties Method
 Retrieves all string properties for the ProjectInfo.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetStringUserProperties(
	ref Hashtable Values
)
Public Function GetStringUserProperties (
	ByRef Values As Hashtable
) As Boolean
Parameters
Values
Type: System.Collections.Hashtable
The return value, a hash table that contains all the values that were retrieved successfully.
Return Value
Type: Boolean
True if at least one single property was retrieved successfully.
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace